# Pandas_vs_SQL_1_2
- join funcation
- uinon funcation
- sort funcation
- case funcation

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
pd.__version__

'1.0.1'

In [7]:
#import data
order_data = pd.read_csv('order.csv')

# join

In [8]:
# import csv
## load user_data
user_data =pd.read_csv('user.csv')
user_data

   id    uid username  age
0   1  10001     nick   23
1   2  10002      bob   24
2   3  10003    david   17
3   4  10004    alice   29
4   5  10005      tom   30
5   6  10006      jim   43
6   7  10007    jimmy   41
7   8  10008     john   28
8   9  10009    frank   20

### pandas join
- merge funcation
    - 'how' means join type

## left join
>
select * 
from user_data
left join order_data
    on user_data.uid = order_data.uid

In [9]:
pd.merge (user_data, order_data, on = 'uid', how = 'left')

    id_x    uid username  age  id_y               ts         orderid  amount
0      1  10001     nick   23     2   2019/8/1 10:00  20190801100006   89.33
1      1  10001     nick   23     5   2019/8/1 14:05  20190801140515   87.15
2      1  10001     nick   23    10   2019/8/2 15:18  20190802151834   71.38
3      1  10001     nick   23    16   2019/8/2 20:08  20190802200816   82.12
4      1  10001     nick   23    25   2019/8/4 12:05  20190804120513   39.76
..   ...    ...      ...  ...   ...              ...             ...     ...
78     9  10009    frank   20    39   2019/8/6 12:05  20190806120531   73.56
79     9  10009    frank   20    48   2019/8/7 17:17  20190807171717   57.67
80     9  10009    frank   20    49   2019/8/7 19:03  20190807190318   50.73
81     9  10009    frank   20    59   2019/8/9 10:11  20190809101113   79.49
82     9  10009    frank   20    76  2019/8/10 17:06  20190810170641   31.54

[83 rows x 8 columns]

## inner join
>
select * 
from user_data
inner join order_data
    on user_data.uid = order_data.uid

In [10]:
pd.merge (user_data, order_data, on = 'uid', how = 'inner')

    id_x    uid username  age  id_y               ts         orderid  amount
0      1  10001     nick   23     2   2019/8/1 10:00  20190801100006   89.33
1      1  10001     nick   23     5   2019/8/1 14:05  20190801140515   87.15
2      1  10001     nick   23    10   2019/8/2 15:18  20190802151834   71.38
3      1  10001     nick   23    16   2019/8/2 20:08  20190802200816   82.12
4      1  10001     nick   23    25   2019/8/4 12:05  20190804120513   39.76
..   ...    ...      ...  ...   ...              ...             ...     ...
78     9  10009    frank   20    39   2019/8/6 12:05  20190806120531   73.56
79     9  10009    frank   20    48   2019/8/7 17:17  20190807171717   57.67
80     9  10009    frank   20    49   2019/8/7 19:03  20190807190318   50.73
81     9  10009    frank   20    59   2019/8/9 10:11  20190809101113   79.49
82     9  10009    frank   20    76  2019/8/10 17:06  20190810170641   31.54

[83 rows x 8 columns]

## outer join
>
select * 
from user_data
outer join order_data
    on user_data.uid = order_data.uid

In [11]:
pd.merge (user_data, order_data, on = 'uid', how = 'outer')

    id_x    uid username  age  id_y               ts         orderid  amount
0      1  10001     nick   23     2   2019/8/1 10:00  20190801100006   89.33
1      1  10001     nick   23     5   2019/8/1 14:05  20190801140515   87.15
2      1  10001     nick   23    10   2019/8/2 15:18  20190802151834   71.38
3      1  10001     nick   23    16   2019/8/2 20:08  20190802200816   82.12
4      1  10001     nick   23    25   2019/8/4 12:05  20190804120513   39.76
..   ...    ...      ...  ...   ...              ...             ...     ...
78     9  10009    frank   20    39   2019/8/6 12:05  20190806120531   73.56
79     9  10009    frank   20    48   2019/8/7 17:17  20190807171717   57.67
80     9  10009    frank   20    49   2019/8/7 19:03  20190807190318   50.73
81     9  10009    frank   20    59   2019/8/9 10:11  20190809101113   79.49
82     9  10009    frank   20    76  2019/8/10 17:06  20190810170641   31.54

[83 rows x 8 columns]

## right join
>
select * 
from user_data
right join order_data
    on user_data.uid = order_data.uid

In [12]:
pd.merge (user_data, order_data, on = 'uid', how = 'right')

    id_x    uid username  age  id_y               ts         orderid  amount
0      1  10001     nick   23     2   2019/8/1 10:00  20190801100006   89.33
1      1  10001     nick   23     5   2019/8/1 14:05  20190801140515   87.15
2      1  10001     nick   23    10   2019/8/2 15:18  20190802151834   71.38
3      1  10001     nick   23    16   2019/8/2 20:08  20190802200816   82.12
4      1  10001     nick   23    25   2019/8/4 12:05  20190804120513   39.76
..   ...    ...      ...  ...   ...              ...             ...     ...
78     9  10009    frank   20    39   2019/8/6 12:05  20190806120531   73.56
79     9  10009    frank   20    48   2019/8/7 17:17  20190807171717   57.67
80     9  10009    frank   20    49   2019/8/7 19:03  20190807190318   50.73
81     9  10009    frank   20    59   2019/8/9 10:11  20190809101113   79.49
82     9  10009    frank   20    76  2019/8/10 17:06  20190810170641   31.54

[83 rows x 8 columns]

## union funcation
- union all
- union

In [13]:
#import csv
## load order_data2
order_data2 = pd.read_csv('order2.csv')

### union all
- union all = won't drop duplicates 

> select * from order_data
union all
select * from order_data2

In [14]:
order_union = pd.concat ([order_data, order_data2])
order_union

     id                   ts    uid         orderid  amount
0     1        2019/8/1 9:15  10005  20190801091540   48.43
1     2       2019/8/1 10:00  10001  20190801100006   89.33
2     3       2019/8/1 10:04  10003  20190801091540   63.86
3     4       2019/8/1 12:17  10002  20190801121742    3.16
4     5       2019/8/1 14:05  10001  20190801140515   87.15
..  ...                  ...    ...             ...     ...
82   83      2019/8/13 15:14  10002  20190813151443   46.87
0   101      2019/8/10 19:24  10012  20190810191433   78.07
1   102      2019/8/11 18:11  10017  20190811151111   82.76
2   103      2019/8/12 15:36  10017  20190812151638   51.90
3   104  2019/8/13  15:14843  10012  20190813151443   76.87

[87 rows x 5 columns]

### union
- union = drop duplicates 

> select * from order_data
union
select * from order_data2

In [15]:
order_union2 = pd.concat ([order_data, order_data2]).drop_duplicates()
order_union2

     id                   ts    uid         orderid  amount
0     1        2019/8/1 9:15  10005  20190801091540   48.43
1     2       2019/8/1 10:00  10001  20190801100006   89.33
2     3       2019/8/1 10:04  10003  20190801091540   63.86
3     4       2019/8/1 12:17  10002  20190801121742    3.16
4     5       2019/8/1 14:05  10001  20190801140515   87.15
..  ...                  ...    ...             ...     ...
82   83      2019/8/13 15:14  10002  20190813151443   46.87
0   101      2019/8/10 19:24  10012  20190810191433   78.07
1   102      2019/8/11 18:11  10017  20190811151111   82.76
2   103      2019/8/12 15:36  10017  20190812151638   51.90
3   104  2019/8/13  15:14843  10012  20190813151443   76.87

[87 rows x 5 columns]

## sort funcation

Pandas supports three kinds of sorting: sorting by index labels, sorting by column values, and sorting by a combination of both.

- sort_values (for this )
- sort_index

## order_by
> select uid, count(distinct orderid)
from order_data
group by uid
order by 2

In [22]:
order_data.groupby ('uid')['orderid'].nunique().sort_values(ascending = False)

uid
10002    17
10003    13
10009    11
10005     9
10001     9
10008     8
10004     8
10007     7
10006     1
Name: orderid, dtype: int64

## order_by
### np.size will drop duplicates
> select 
    uid
    , count(distinct orderid) as order_cnt
    ,sum(amount) as sum_amount
from order_data
group by uid
order by 2

In [17]:
order_df = order_data.groupby('uid').agg({'orderid' : np.size, 'amount' : np.sum})
order_df.rename (columns= {'orderid' : 'order_cnt', 'amount' : 'sum_amount'}, inplace= True)
order_df.sort_values (by = ['uid', 'sum_amount'], ascending = [True,False])

       order_cnt  sum_amount
uid
10001          9      528.15
10002         17      775.60
10003         13      686.17
10004          8      591.39
10005          9      444.01
10006          1       65.44
10007          7      331.65
10008          8      425.38
10009         11      621.32

## case funcation
select
    uid
    ,order_cnt
    ,case
        when sum_amount < 300 then '(0-300)'
        when sum_amount >= 300 and sum_amount < 600 then '(300-600)'
        when sum_amount >= 600 and sum_amount < 900 then '(600-900)'
        else 'other'
    end as amt_interval

from 
    (
        
        select
            uid
            ,count(distinct orderid) as order_cnt
            ,sum(amount) as sum_amount
        
        from order_data
        group by uid
        order by 
            uid desc
            , sum(amount)
    ) t1

In [18]:
def func(x):
        if x < 300:
            return '(0-300)'
        elif x < 600:
            return '(300,600)'
        else:
            return '(600,900)'

In [19]:
order_df['amt_intreval'] = order_df['sum_amount'].map(func)
order_df

       order_cnt  sum_amount amt_intreval
uid
10001          9      528.15    (300,600)
10002         17      775.60    (600,900)
10003         13      686.17    (600,900)
10004          8      591.39    (300,600)
10005          9      444.01    (300,600)
10006          1       65.44      (0-300)
10007          7      331.65    (300,600)
10008          8      425.38    (300,600)
10009         11      621.32    (600,900)

In [20]:
pd.cut(np.array([1,2,3,4,5,6,7,7,8]),3)

[(0.993, 3.333], (0.993, 3.333], (0.993, 3.333], (3.333, 5.667], (3.333, 5.667], (5.667, 8.0], (5.667, 8.0], (5.667, 8.0], (5.667, 8.0]]
Categories (3, interval[float64]): [(0.993, 3.333] < (3.333, 5.667] < (5.667, 8.0]]